app/controllers/posts_controller.rb

SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
---
  def index
    @authors = Author.all
    if params[:author].present?
      @posts = Post.by_author(:author)
    elsif params[:date].present?
      if params[:date] == "Today"
        @posts = Post.from_today
      else
        @posts = Post.old_news
      end
    else
      @posts = Post.all